; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v4 - type_3 ?v5 - type_2)
 	      (pred_1 ?v8 - object ?v5 - type_2)
	      (pred_3 ?v4 - type_3 ?v6 - type_1)
	      (pred_2 ?v4 - type_3 ?v8 - object ?v6 - type_1))

   (:action op_1
       :parameters  (?v4 - type_3 ?v2 ?v1 - type_2)
       :precondition (and  (pred_4 ?v4 ?v2))
       :effect (and  (pred_4 ?v4 ?v1)
		     (not (pred_4 ?v4 ?v2))))

   (:action op_3
       :parameters (?v4 - type_3 ?v7 - object ?v3 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_1 ?v7 ?v3) (pred_4 ?v4 ?v3) (pred_3 ?v4 ?v6))
       :effect (and (pred_2 ?v4 ?v7 ?v6)
		    (not (pred_1 ?v7 ?v3)) 
		    (not (pred_3 ?v4 ?v6))))

   (:action op_2
       :parameters (?v4 - type_3 ?v7 - object ?v3 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_2 ?v4 ?v7 ?v6) (pred_4 ?v4 ?v3))
       :effect (and (pred_1 ?v7 ?v3)
		    (pred_3 ?v4 ?v6)
		    (not (pred_2 ?v4 ?v7 ?v6)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_06 obj_11 - type_3
obj_03 obj_08 obj_10 obj_02 - type_1
obj_05 obj_01 obj_14 obj_07 - type_2
obj_04 obj_12 obj_13 obj_09 - object)
(:init
(pred_4 obj_06 obj_05)
(pred_3 obj_06 obj_03)
(pred_3 obj_06 obj_08)
(pred_4 obj_11 obj_05)
(pred_3 obj_11 obj_10)
(pred_3 obj_11 obj_02)
(pred_1 obj_04 obj_05)
(pred_1 obj_12 obj_14)
(pred_1 obj_13 obj_05)
(pred_1 obj_09 obj_07)
)
(:goal
(and
(pred_1 obj_04 obj_07)
(pred_1 obj_12 obj_05)
(pred_1 obj_13 obj_14)
(pred_1 obj_09 obj_07)
)
)

(:constraints
  (always (not (pred_4 obj_06 obj_14)))
)
)

; plan
1. (op_3 obj_11 obj_04 obj_05 obj_02)
   deleted: (pred_1 obj_04 obj_05) (pred_3 obj_11 obj_02)
   added: (pred_2 obj_11 obj_04 obj_02)
   goals met: 1 of 4
2. (op_3 obj_06 obj_13 obj_05 obj_08)
   deleted: (pred_1 obj_13 obj_05) (pred_3 obj_06 obj_08)
   added: (pred_2 obj_06 obj_13 obj_08)
   goals met: 1 of 4
3. (op_1 obj_11 obj_05 obj_07)
   deleted: (pred_4 obj_11 obj_05)
   added: (pred_4 obj_11 obj_07)
   goals met: 1 of 4
4. (op_2 obj_11 obj_04 obj_07 obj_02)
   deleted: (pred_2 obj_11 obj_04 obj_02)
   added: (pred_1 obj_04 obj_07) (pred_3 obj_11 obj_02)
   goals met: 2 of 4
5. (op_1 obj_11 obj_07 obj_14)
   deleted: (pred_4 obj_11 obj_07)
   added: (pred_4 obj_11 obj_14)
   goals met: 2 of 4
6. (op_3 obj_11 obj_12 obj_14 obj_02)
   deleted: (pred_1 obj_12 obj_14) (pred_3 obj_11 obj_02)
   added: (pred_2 obj_11 obj_12 obj_02)
   goals met: 2 of 4
7. (op_1 obj_11 obj_14 obj_05)
   deleted: (pred_4 obj_11 obj_14)
   added: (pred_4 obj_11 obj_05)
   goals met: 2 of 4
8. (op_2 obj_11 obj_12 obj_05 obj_02)
   deleted: (pred_2 obj_11 obj_12 obj_02)
   added: (pred_1 obj_12 obj_05) (pred_3 obj_11 obj_02)
   goals met: 3 of 4
9. (op_2 obj_06 obj_13 obj_05 obj_08)
   deleted: (pred_2 obj_06 obj_13 obj_08)
   added: (pred_1 obj_13 obj_05) (pred_3 obj_06 obj_08)
   goals met: 3 of 4
10. (op_3 obj_11 obj_13 obj_05 obj_02)
   deleted: (pred_1 obj_13 obj_05) (pred_3 obj_11 obj_02)
   added: (pred_2 obj_11 obj_13 obj_02)
   goals met: 3 of 4
11. (op_1 obj_11 obj_05 obj_14)
   deleted: (pred_4 obj_11 obj_05)
   added: (pred_4 obj_11 obj_14)
   goals met: 3 of 4
12. (op_2 obj_11 obj_13 obj_14 obj_02)
   deleted: (pred_2 obj_11 obj_13 obj_02)
   added: (pred_1 obj_13 obj_14) (pred_3 obj_11 obj_02)
   goals met: 4 of 4
